class Book {
  final String name;
  final String author;
  final String description;
  final String imageUrl;
  Book({
    required this.name,
    required this.author,
    required this.description,
    required this.imageUrl,
  });
}

List<String> content = [
  '  楚國，璃王府。“賤人，你明知道本王明天要娶柔兒，竟然敢給本王下藥？”錦衣華服的男人怒吼完，滿帶恨意的瞪了床上的女人一眼，然後，他懷揣著狂怒與殺氣，一把撕掉了女人身上的衣服，朝她覆了上去。看著男人的動作，雲若月的眼淚無聲無息的滑落。她嫁給他半年，他心中卻只有南宮柔的身影，他從來沒碰過她，皆是因為她有一張醜陋的臉，還有一對他仇恨的雙親。“啊！”劇烈的痛苦襲來，痛得雲若月冷汗淋漓，她難受的咬著唇，看著上方那張厭惡又冷酷的臉，心痛如刀絞。比起他的厭惡和憎恨，她身上的痛又算得了什麼。楚玄辰冷冷的瞪著雲若月，“你為了得到本王，不惜給本王下藥，好，本王今天就成全你！不過，本王看不下你這張臉，因為它實在是太惡心了！”楚玄辰說完，猛地扯下床幔上的紗巾，蓋到了雲若月臉上。這話，重重的刺痛了雲若月。她痛苦的撫摸著自己的臉，她的右臉上有一塊手掌大的疤痕，導致她一直很自卑。世人都叫她醜女，可她也有一顆追愛的心。父親知道她從小就仰慕璃王楚玄辰，硬是利用自己和皇上的關系，求皇上將她賜給了楚玄辰。可是，楚玄辰並不愛她。這時候，身上男人的動作突然加重，他幾乎凌虐的折磨著她，烏黑的眼眸裡全是駭人的殺意，“雲若月，你這個蛇蠍心腸的女人，你知道本王喜歡柔兒，就設計讓本王娶你；你知道本王明天要娶柔兒，就設計讓本王碰你。如果不是你下藥，就憑你這張臉，誰會碰你？本王寧願碰外面的伎女，也不會碰你！”雲若月看著楚玄辰，強忍著他暴風雨般的欺凌，凄涼的冷笑，“在你心中，我連外面的伎女都不如？“不，在本王心中，你連條狗都不如！”',
  '過了很久，楚玄辰終於要盡雲若月的身，風卷殘雲般的起身。他迅速穿好衣裳，根本不管床上渾身青紫、奄奄一息的女人。解了毒，這個女人對他來說，就一無是處了。然後，他嫌惡的掃了床上的女人一眼，毫不留情的走了出去，吩咐丫環，“備水，本王要沐浴，本王不想被人髒了身子！”聽到這刺骨的話，雲若月的身子猛地一抖，她的心瞬間涼透了。楚玄辰的話像鋼刀一樣狠狠的刺在雲若月心髒上，她現在才明白，原來他這麼厭惡她。他之前冷落她，不理她，她都仍對他心存幻想，她覺得只要她對他好，他遲早會看清她的真心，不會像別的男人那樣因為她醜，就厭惡她。沒想到，在他心中，她竟然這麼的不堪。她看著那床上和下身的鮮血，看著自己破敗的身子，想著他對她的討厭和欺辱，心裡頓時沒了寄托，她顫抖的裹上一件衣袍，光著腳，走進了寒風蕭瑟的冬夜裡。在離緋月閣不遠的地方，有一汪湖泊。深夜，寒風凜冽，湖水刺人。只聽“撲通”一聲，有人大喊道：“不好了，王妃投湖了！”',
  '湖邊，一群王府下人站成一排，全都冷冷的盯著躺在岸邊的王妃。此時，王妃娘娘身邊只有一個小丫環在哭。“娘娘，你別死啊，你死了奴婢怎麼辦？”鳳兒傷心難過的哭著。旁邊的張嬤嬤冷冷的瞪了她一眼，“哭什麼哭？真是晦氣，死也不換個地方死，偏偏死在我們王府。王爺說了，別讓她的屍體髒了王府的地，既然大夫看過已經死了，直接拖出去埋了吧！”“不要啊嬤嬤，不要這樣對我家小姐，她可是宰相之女……”現場亂作一團的時候，大家都沒看到，那原本沒氣了的人，緩緩的睜開了眼睛。雲若月一睜開眼睛，頓時看清了四周的一切，此時月黑風高，一大堆身著古裝的女人，正對著她的“屍體”指指點點。猛地，一陣寒風吹來，她頓時打了個寒戰。她想起來了，她本是二十一世紀的國際頂尖外科醫生，才三十歲的年紀，就因為替各國首腦醫治了無數疑難雜症，被譽為天才醫學家，結果卻在下班回家的路上，被一個酒駕的人撞死了。然後，她的靈魂就穿越到了這裡，並且附在了這具身體之上。天哪，要是現代的人知道她一個治病救人的頂尖醫生，居然死於酒駕之手，大家得有多恨那個酒駕的混蛋？同時，她腦海中浮起了一段陌生的記憶，全是關於這具身體的主人的。原來這具身體的主人，也叫雲若月，居然和她同名同姓，這是不是一種特別的緣分？',
  '原主雲若月，是當朝宰相雲清的嫡女，從小被雲家示為掌上明珠，悉心培養。她原本長得十分漂亮，很是惹人喜愛，但是在她十歲那年，她莫名其妙的中了毒，導致全身發黑。當時她差點死掉，父親好不容易才請人治好她，她雖然撿回一條性命，但是右臉卻因為中毒太深，上面的毒素去不了，最後變成了一塊醜陋的疤痕。她從此變得非常自卑。她的容貌變得十分醜陋，那些官家子弟們都開始瞧不起她，欺負她，打壓她，當時她在一個湖邊被一群官家子弟圍攻的時候，楚玄辰突然走了出來，保護了她。他趕走那些官家子弟，還遞給她一塊面紗遮面，給了她很多溫暖。從此，她就深深的愛上了楚玄辰。她知道她一介醜女，配不上楚玄辰，就把那些愛慕藏在了心裡，她從不痴心妄想可以嫁給楚玄辰。可父親看出了她的心思，為了讓她幸福，他硬是利用自己和皇帝的關系，求皇上，讓她嫁給楚玄辰。她嫁給璃王的夢倒是圓了，可惜，成親半年，璃王連正眼都沒看她一眼。不僅沒看她一眼，還馬上就要娶新夫人進門了，這原主活得真窩囊。腦海裡正在理清這些信息的時候，突然，雲若月發現有下人來拖她，旁邊是婆子們的罵聲，和鳳兒的哭聲。“快，把這個晦氣的掃把星拖出去埋了，時間長了，萬一屍變了怎麼辦？”張嬤嬤說。“住手！”見有人要靠近自己，雲若月突然費力的出聲！啊！屍變了，王妃變成厲鬼了！”眾人尖叫一聲，全都朝旁邊四散了開去，只有鳳兒沒有離開，依然守在雲若月身邊。',
  '“吵什麼吵？你才屍變，沒見過活人？”雲若月冷冷的出聲，對鳳兒說，“扶我起來。”她才被人從水中打撈起來，再加上之前又受了楚玄辰一番凌虐，現在身體很虛弱，連走路的力氣都沒有。現在，她知道她這具身體是王妃，應該具有王妃的威嚴，可以震懾一下這幫人。“娘娘，您醒了？”張嬤嬤不敢相信的盯著雲若月。剛才大夫明明說了，王妃已經死了，怎麼還會活過來？看王妃的神情，並不像屍變，應該是真的活過來了。難不成剛才那位大夫診斷錯了？“怎麼，我醒了，你很失望？”雲若月冷眼看著張嬤嬤。平素在府中，張嬤嬤是最愛欺負她們主僕的。不過，這若沒有璃王的縱容，這些人也不敢欺負她。她一不受寵，人一軟弱，就受這王府上上下下所有人的欺負。但是從今天開始，她接替了這具身體，就由不得這些人再欺負她半分了！她的人生她作主，誰要是再敢欺凌她，別怪她無情！張嬤嬤平時都不怕王妃娘娘，可是這一刻，她好像從王妃眼中看出了森冷的殺意，她嚇得牙齒一打顫，小聲的說，“老奴不敢，老奴這就去稟告王爺。”當著這麼多下人的面，張嬤嬤收斂了自己的狠毒，畢竟現在若月沒死，她還是王府的王妃，也是宰相的嫡女。如果雲若月真想治她，她是跑不了的。但是她有靠山，那就是璃王。她暫時饒雲若月一馬，去找了璃王再說，有璃王在，這女人哪裡敢擺王妃的譜。',
  '緋月閣。鳳兒一把雲若月扶進房，就給她打來了熱水，讓她沐浴。下身撕裂的疼痛，提醒雲若月她今天被凌虐了的事實。那個男人真的好狠，居然這樣折磨自己的王妃。雲若月坐進浴桶裡，便叫鳳兒幫她拿了面鏡子，她倒要看看，這具身體的原主人到底有多醜，醜得楚玄辰在要她的時候，居然拿紗布遮住她的臉。當鏡子照到自己面容的那一瞬間，雲若月也差點嘔吐了。這副尊容真是太醜了，她右臉上全是蜿蜒曲折的疤痕，有點像瘤子，又像毒素，怪不得楚玄辰會那麼討厭她。如果換在現代，她擁有一整間生物科學實驗室，裡面有各種特制的藥品，很容易就能把她的臉治好，可是這是在古代。她一個沒有手術室的醫生，就像一個沒有雙手的鋼琴家。這熱水泡得身體很舒服，雲若月有些累了，便把鏡子放在旁邊，雙手倚著浴桶，慢慢的沉睡了過去。睡夢中，她的意識深處，突然浮現了她的那間實驗室。她看到好多藥品，還有她以前用過的醫療器材，無菌手術室，電腦，呼吸機，血氧儀，CT，助聽器，核磁共振等全都有。作為一個醫生，看到這些熟悉的裝備，她心裡是激動的。不過她知道，這只是一場夢，是她太想念自己的手術刀了，才會做這種夢。突然，她看到那成排的藥櫃裡，竟然擺著一瓶“低聚原花青素”，一看到這藥，她的瞳孔都睜大了。',
  '這可是她自己研制的，可以用於治療毀容，去除毒素，膿包和瘤子的藥物，此藥由葡萄籽和其他藥物提取而成，正好可以治她臉上的毒素。雲若月心神一動，伸手一取，就把這花青素給取下來了。她又取了幾瓶消炎藥，幾塊紗布，這才將意識拉攏回來。“娘娘，您睡著了嗎？水涼了，奴婢給你加點熱水，不然你會著涼的。”這時，雲若月耳邊傳來鳳兒的聲音。她嚇得猛地睜開眼睛，看到鳳兒提著一只桶，正往她的浴桶裡倒熱水。她再往手裡一看，發現手裡竟然拿著她之前在夢裡取的藥。她頓時震驚了，這是怎麼回事？她不敢相信的盯著手裡的藥，呼吸停滯，渾身緊張，連毛孔都豎了起來。她剛才只是意念一動，就可以把實驗室裡的東西取出來，難道，她的實驗室，也跟著她穿越了過來，而且還存在於她的意識空間裡。也就是說，她現在擁有自己以前的醫療空間系統，這也太奇特了吧。這個世界上很多事情都很奇妙，連她的靈魂都可以穿越過來，她的醫療系統跟著穿過來，應該也是可以理解的想到這裡，雲若月頓時激動得渾身顫抖，血液沸騰。她對鳳兒說，“我不洗了，你先出去，我自己穿衣服。”“娘娘，你不需要奴婢幫你穿衣嗎？”鳳兒問。“不用了，我喜歡自己來。”鳳兒頓時愣了一下，她怎麼感覺，自從娘娘跳湖醒來之後，性格就變了，變得和以前不太一樣。在鳳兒出去之後，雲若月拖著疲憊的身子起身，她的身體還是很虛弱，並且因為跳湖感染了風寒，所以現在，她畏寒，渾身發抖，且還有發高燒的架式。',
  '古人的衣服很復雜，沒人幫忙還真不好穿，好不容易穿好了衣服，雲若月趕緊坐到梳妝鏡前，把從醫療系統裡拿出來的藥擺好。她看了看自己的右臉，發現上面的毒素沉澱得很深，想要解這種毒，還需要費點精力。她先清理干淨右臉，再在上面塗滿消炎藥，塗完後，就塗上那瓶低聚原花青素，最後，她在臉上貼了塊紗布，如果臉上有毒血冒出來，這紗布可以吸掉那毒血。這花青素是她專門研制的，和普通的不一樣，只要一個夜晚，就能治好她的臉，她真有些期待明天一早，這張臉會變成什麼樣子。就在這時，外面傳來鳳兒驚恐的聲音，“王爺，王妃在沐浴，您不能進去。”鳳兒真怕璃王又來凌虐自己的主子。楚玄辰的聲音既冷又毒，“你以為本王想踏進這鬼地方？本王只是想看看，她為何沒死成？”雲若月迅速的戴上面紗，用面紗遮住臉，冷冷的勾起唇，走到房門前，冷聲對外面守著的鳳兒吩咐，“鳳兒，告訴王爺，夜深了，本王妃累了，恕不見客！”言下之意，她這是對楚玄辰下逐客令。聽到這話，楚玄辰以為自己聽岔了，這女人不是最希望他來她房裡麼？不惜給他下藥，也要他上她的床，現在裝什麼清高？'
];
final List<Book> books = [
  Book(
    name: '寵妾滅妻？這首輔夫人我不當了',
    author: '二綸',
    imageUrl:
        'https://imgbk.83novel.com/share/2024-02-09/09/329b3d5f4bb9d351de4b8c7e9f18480e.jpg',
    description:
        '上輩子做了一世的惡毒假千金，落得慘死下場。重生回來後，蘇青玉決定遠離一切，瀟灑自在。 可她擺爛放手後，高冷夫君怎麼纏上來了？ 她不爭寵了，爹娘反而對她噓寒問暖了。 就連兩個哥哥也是，不僅警告找回來的白蓮花離她遠點，還說家裡的寵愛都是蘇青玉的。 蘇青玉：？ 怎麼她重生擺爛後，反而還更受寵了？ 那個冰山權臣，你滾遠點呀！ ',
  ),
  Book(
    name: '重生之妖嬈毒後',
    author: '鹿鹿',
    imageUrl:
        'https://static.ttkan.co/cover/zhongshengzhiyaoraoduhou-baobeilulu.jpg?w=120&h=160&q=100',
    description:
        '一句話簡介，這個是一個被渣男和渣女算計之後，奮起反擊，報復過後，卻意外重生，活出錦繡人生，收穫真愛的故事。蕭家嫡女，風華絕代，妖嬈嫵媚，癡戀太子。二人郎才女貌，乃是天作之合。十年夫妻，蕭紫語殫精極慮，傾盡蕭家一切，輔佐夫君，清除了一切障礙，終於登上了皇位。卻不料十年夫妻，十年恩愛，只是一場笑話。只是寧負天下人',
  ),
  Book(
    name: '通房丫鬟',
    author: '寒江雪',
    imageUrl: 'https://www.cuisiliu.com/bookcover/86/86119.jpg',
    description:
        '身為通房丫鬟，花容一直謹記自己的身份。不和主子談情說愛，不讓主子沉迷女色，不與未來少夫人爭風吃醋。好不容易熬到年老色衰贖回奴身，花容看上一位老實本分的鰥夫準備搭夥過日子。身份尊貴的主子卻紅著眼將她抵在牆上問：“你寧肯要那個老東西也不要我？人間清醒通房丫鬟VS腹黑紈絝少爺',
  ),
  Book(
    name: '天才女神醫穿越成棄妃',
    author: '楚玄辰',
    imageUrl:
        'https://imgbk.83novel.com/share/2023-03-09/10/3da2d909f2f9a739fa1d714132374fb8.jpg',
    description:
        '她是21世紀的天才神醫,卻穿越成不受寵的棄妃,冷面王爺納妾來惡心她,洞房花燭夜,居然讓她這個王妃去伺候,想羞辱她是吧？行啊！想羞辱她,她就惡心得他不舉。冷王威脅她,“要想本王不休你,你就老老實實的聽話。”她笑道,“王爺,我已經向皇上請旨和離,還會帶著孩子再嫁,你千萬別擔心。”看醜女如何變身為貌美的天才神醫,驚艷天下。',
    // content: ['', '', '', '', '', '', '', '', '', '']
  ),
  Book(
    name: '腹黑世子妃日常',
    author: '花間雪',
    imageUrl:
        'https://static.ttkan.co/cover/fuheishizifeirichang-huajianxue.jpg?w=120&h=160&q=100',
    description:
        '南陽趙氏，簪纓世家，趙氏女無子封后，無限榮光。 天子雖值盛年，但皇子們羽翼漸滿，奪位之爭，迫在眉睫。 趙氏族長爲家族的榮華富貴、長盛不衰，亦爲皇后固寵，要從族中挑選容貌好的適齡女子，進行調教，以期聯姻之用。 望舒倒黴催的，成了被選中的十人之一。 要如同勾欄女子般，周旋在衆貴公子之間嗎？ 望舒表示，這差事她幹不了。 她要撩的人，必是她所喜的人。 路過的那小子，對，沒錯，說得就是你！',
  ),
  Book(
    name: '世家族女',
    author: '夜纖雪',
    imageUrl:
        'https://static.ttkan.co/cover/shijiazunv-yexianxue.jpg?w=120&h=160&q=100',
    description:
        '一朝穿越，腹黑狡詐的她竟成身中寒毒的病弱千金，未婚夫唯利是圖，將她貶爲賤妾，她冷冷一笑，勇退婚，甩渣男，嫁世子，亮瞎了滿朝文武的眼。 不過，世子，說好的只是合作算計人，你怎麼假戲真做了？喂喂，別說話不算話啊。',
  ),
];
